Revit 2027 API
EditScope.Cancel Method
 Cancels the edit scope.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Cancel()
Public Sub Cancel
public:
void Cancel()
member Cancel : unit -> unit
Exceptions
Exception | Condition
InvalidOperationException |  EditScope is not active. EditScope can only be committed or cancelled when it is active. -or- EditScope cannot be closed, for there is a transaction or transaction group still open in the document.
Remarks
 All the changes made after starting the EditScope will be rolled back.
See Also
Reference
EditScope Class
Autodesk.Revit.DB Namespace